# Week 10 Activity

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('./datasets/employee.csv')
df.head()

            name   age   income gender  department grade  performance_score
0    Allen Smith  45.0      NaN    NaN  Operations    G3                723
1        S Kumar   NaN  16000.0      F     Finance    G0                520
2    Jack Morgan  32.0  35000.0      M     Finance    G2                674
3      Ying Chin  45.0  65000.0      F       Sales    G3                556
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2                711

In [3]:
df.shape

(9, 7)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               9 non-null      object
 1   age                7 non-null      float64
 2   income             7 non-null      float64
 3   gender             7 non-null      object
 4   department         9 non-null      object
 5   grade              9 non-null      object
 6   performance_score  9 non-null      int64
dtypes: float64(2), int64(1), object(4)
memory usage: 632.0+ bytes

There is not null values in name column so good to make it as index

In [9]:
df.groupby('gender')['name'].count()

gender
F    5
M    2
Name: name, dtype: int64

Identity of 2 members is unknown.

### 2. Reset the index as "name" as the index.

In [11]:
df.set_index('name', inplace= True)
df.head()

                age   income gender  department grade  performance_score
name
Allen Smith    45.0      NaN    NaN  Operations    G3                723
S Kumar         NaN  16000.0      F     Finance    G0                520
Jack Morgan    32.0  35000.0      M     Finance    G2                674
Ying Chin      45.0  65000.0      F       Sales    G3                556
Dheeraj Patel  30.0  42000.0      F  Operations    G2                711

### 3. Select rows for specific names Jack Morgan and Josh wills.

In [17]:
df.loc[['Jack Morgan','Josh Wills']]

              age   income gender department grade  performance_score
name
Jack Morgan  32.0  35000.0      M    Finance    G2                674
Josh Wills   54.0  52000.0      F    Finance    G3                901

### 4. Select data for multiple values "Sales" and “Finance”.

In [29]:
df[df['department'].isin(['Sales','Finance'])].sort_values(by= 'grade',ascending=False)

                age   income gender department grade  performance_score
name
Leo Duck       23.0  98000.0      M      Sales    G4                709
Ying Chin      45.0  65000.0      F      Sales    G3                556
Satyam Sharma   NaN  62000.0    NaN      Sales    G3                649
Josh Wills     54.0  52000.0      F    Finance    G3                901
Jack Morgan    32.0  35000.0      M    Finance    G2                674
S Kumar         NaN  16000.0      F    Finance    G0                520

### 5. Display employee who has more than 700 performance score.

In [30]:
df[df.performance_score>700].sort_values(by= 'performance_score',ascending=True)

                age   income gender  department grade  performance_score
name
Leo Duck       23.0  98000.0      M       Sales    G4                709
Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
Allen Smith    45.0      NaN    NaN  Operations    G3                723
Josh Wills     54.0  52000.0      F     Finance    G3                901

### 6. Display employee who has more than 500 and less than 700 performance score

In [38]:
df[df.performance_score.between(500,700)].sort_values(by= 'performance_score',ascending=True)

                age   income gender department grade  performance_score
name
S Kumar         NaN  16000.0      F    Finance    G0                520
Ying Chin      45.0  65000.0      F      Sales    G3                556
Satyam Sharma   NaN  62000.0    NaN      Sales    G3                649
Jack Morgan    32.0  35000.0      M    Finance    G2                674

### 7. Check and handle missing values in the dataset.

In [40]:
df.isna().sum()

age                  2
income               2
gender               2
department           0
grade                0
performance_score    0
dtype: int64

In [55]:
print("Number of NAN rows = ",df.isna().any(axis=1).sum())
df[df.isna().any(axis=1)]

Number of NAN rows =  4

                age   income gender  department grade  performance_score
name
Allen Smith    45.0      NaN    NaN  Operations    G3                723
S Kumar         NaN  16000.0      F     Finance    G0                520
Satyam Sharma   NaN  62000.0    NaN       Sales    G3                649
James Authur   54.0      NaN      F  Operations    G3                 53

From the dataset it is clear we have 4 candidates with missing values.<br>
Since **Gender** cannot be filled considering other attributes we drop rows with gender is null

In [76]:
df_after_drop = df.drop(df[df['gender'].isna()].index)

In [77]:
df_after_drop

                age   income gender  department grade  performance_score
name
S Kumar         NaN  16000.0      F     Finance    G0                520
Jack Morgan    32.0  35000.0      M     Finance    G2                674
Ying Chin      45.0  65000.0      F       Sales    G3                556
Dheeraj Patel  30.0  42000.0      F  Operations    G2                711
James Authur   54.0      NaN      F  Operations    G3                 53
Josh Wills     54.0  52000.0      F     Finance    G3                901
Leo Duck       23.0  98000.0      M       Sales    G4                709